src/author.org
# -*- coding:utf-8 -*-
#+LANGUAGE:  zh
#+TITLE:     纪秀峰_个人简历(Erlang求职)
#+AUTHOR:    纪秀峰
#+EMAIL:     jixiuf@gmail.com
#+DATE:     2012-03-14 三
#+DESCRIPTION:个人简历
#+KEYWORDS: 个人简历
#+OPTIONS:   H:2 num:nil toc:nil \n:t @:t ::t |:t ^:nil -:t f:t *:t <:t
#+FILETAGS:
* Word 版简历
+  [[file:download/JiXiufeng_Erlang.doc][纪秀峰_Erlang.doc]]
* 基本信息
  |------------+--------------------|
  | 电    话   | 13522419247　      |
  | 出生年月   | 1989-01            |
  | E-mail     | jixiuf@qq.com　    |
  | 英语水平   | 六级460            |
  | 证    书   | 数据库三级         |
  | 毕业院校   | 青岛科技大学       |
  | 学    历   | 本科 2007-9~2011-7 |
  | 户口所在地 | 山东青岛           |
  | 现居住地   | 北京海淀区         |
* 择业目标：
  + Erlang 开发工程师
* 自我介绍：
Erlang个人代码仓库:   https://github.com/jixiuf/helloerlang
EmacsWiki个人主页：  http://emacswiki.org/Joseph
个人主页:              http://jixiuf.github.com/sitemap.html
csdn博客：            http://blog.csdn.net/jixiuffff
自学能力强，所有计算机知识均为自学。以上几个网址是个人成果的展示， Erlang个人代码仓库为
学习Erlang过程中写的一些代码; EmacsWiki个人主页  为我为Emacs开源社区贡献的代码。
* 专业技能：
+ 具有较强自学能力，熟悉erlang ,emacs lisp 函数式编辑语言。
+ 熟悉mnesia、ets ,熟悉erlang 的OTP(gen_server gen_event等模块的使用) 。
+ 一年Emacs编辑器使用经验，熟练掌握Emacs Lisp语言，为emacs开源社区贡献过代码，
+ 其中主要代码放在 [[http://www.emacswiki.org/emacs/Joseph][emacswiki/Joseph]] ,包括erlang开发用的 [[https://github.com/jixiuf/erlang-dired-mode][erlang-dired-mode.el]]
  并对 emacs下 erlang 开发工具distel 进行增强[[http://jixiuf.github.com/erlang/distel.html][distel介绍]]
+ 半年erlang实际开发经验、有一定的代码积累
+ 三年Linux(Gentoo)系统使用经验。
+ 掌握基于Oracle的数据库编程：JDBC 、 PLSQL；
+ 熟悉java 编程语言，有一定的c c++基础
* 开发经验：
** 页游桃园外传项目(2012-2~2012-9)
   在乐元素公司旗下桃园外传项目组内负责erlang服务器端代码的编写,有erlang连
   mysql memcached等数据库的经验，了解 memcached、redis的协议并尝试
   用erlang实现与之连接,有一定的代码积累及调优经验.

**      海华生产管理系统(2011-7~2011-11)
    为青岛海华纤维有限公司（主要生产假发的半成品）编写生产管理系统 。主要分为三大模块：
1. 数据收集模块主要通过PDA(掌上电脑)条码扫描器从各袋半制品上的条码上扫描得到数
      据(进行盘点)、以及进行入库、出库操作。
2. PC 端，也同时可以进行入库、出库、数据统计、盘点、条形码打印等操作。PC端 主要
      使用C#、Silverlight WCF 等技术，后台数据库用SQL Server 2008。 前台界面使
      用Silverlight模仿Window7 操作系统，主要实现了用户权限控制、半制品（分为4
      个类似模块:半制品仓库、中间仓库、灌壁仓库、粉碎丝仓库）分别有入库、出库、
      统计、盘点等功能。
3. 条形码的生成通过调用TSC dll的打印功能实现。打印模块各独做成一个服务，放在服
      务器上，无论是扫描器端 、还是PC端都可以远程调用打印机进行条形码的打印
4. 我主要负责的tsc条码打印服务的编写、及条形码扫描器端3个出库画面、半制品盘点、
   灌壁盘点)(灌壁入库)、 等多个画面。PC端负责1个盘点画面(半制品盘点)、3个出库画
   面(中间仓库出库、灌壁出库、 粉碎丝出库、)、及半制品的管理(新增、更新、冻结、
   初始化库存)等操作。
