htmlized-src/author.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>author.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">&#32426;&#31168;&#23792;_&#20010;&#20154;&#31616;&#21382;(Erlang&#27714;&#32844;)</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2012-03-14 &#19977;</span>
<span class="org-meta-line">#+DESCRIPTION:&#20010;&#20154;&#31616;&#21382;
#+KEYWORDS: &#20010;&#20154;&#31616;&#21382;
#+OPTIONS:   H:2 num:nil toc:nil \n:t @:t ::t |:t ^:nil -:t f:t *:t &lt;:t
#+FILETAGS:
</span><span class="org-level-1">* Word &#29256;&#31616;&#21382;</span>
+  <span class="org-link">&#32426;&#31168;&#23792;_Erlang.doc</span>
<span class="org-level-1">* &#22522;&#26412;&#20449;&#24687;</span>
  <span class="org-table">|------------+--------------------|</span>
  <span class="org-table">| &#30005;    &#35805;   | 13522419247&#12288;      |</span>
  <span class="org-table">| &#20986;&#29983;&#24180;&#26376;   | 1989-01            |</span>
  <span class="org-table">| E-mail     | jixiuf@qq.com&#12288;    |</span>
  <span class="org-table">| &#33521;&#35821;&#27700;&#24179;   | &#20845;&#32423;460            |</span>
  <span class="org-table">| &#35777;    &#20070;   | &#25968;&#25454;&#24211;&#19977;&#32423;         |</span>
  <span class="org-table">| &#27605;&#19994;&#38498;&#26657;   | &#38738;&#23707;&#31185;&#25216;&#22823;&#23398;       |</span>
  <span class="org-table">| &#23398;    &#21382;   | &#26412;&#31185; 2007-9~2011-7 |</span>
  <span class="org-table">| &#25143;&#21475;&#25152;&#22312;&#22320; | &#23665;&#19996;&#38738;&#23707;           |</span>
  <span class="org-table">| &#29616;&#23621;&#20303;&#22320;   | &#21271;&#20140;&#28023;&#28096;&#21306;         |</span>
<span class="org-level-1">* &#25321;&#19994;&#30446;&#26631;&#65306;</span>
  + Erlang &#24320;&#21457;&#24037;&#31243;&#24072;
<span class="org-level-1">* &#33258;&#25105;&#20171;&#32461;&#65306;</span>
Erlang&#20010;&#20154;&#20195;&#30721;&#20179;&#24211;:   <span class="org-link">https://github.com/jixiuf/helloerlang</span>
EmacsWiki&#20010;&#20154;&#20027;&#39029;&#65306;  <span class="org-link">http://emacswiki.org/Joseph</span>
&#20010;&#20154;&#20027;&#39029;:              <span class="org-link">http://jixiuf.github.com/sitemap.html</span>
csdn&#21338;&#23458;&#65306;            <span class="org-link">http://blog.csdn.net/jixiuffff</span>
&#33258;&#23398;&#33021;&#21147;&#24378;&#65292;&#25152;&#26377;&#35745;&#31639;&#26426;&#30693;&#35782;&#22343;&#20026;&#33258;&#23398;&#12290;&#20197;&#19978;&#20960;&#20010;&#32593;&#22336;&#26159;&#20010;&#20154;&#25104;&#26524;&#30340;&#23637;&#31034;&#65292; Erlang&#20010;&#20154;&#20195;&#30721;&#20179;&#24211;&#20026;
&#23398;&#20064;Erlang&#36807;&#31243;&#20013;&#20889;&#30340;&#19968;&#20123;&#20195;&#30721;; EmacsWiki&#20010;&#20154;&#20027;&#39029;  &#20026;&#25105;&#20026;Emacs&#24320;&#28304;&#31038;&#21306;&#36129;&#29486;&#30340;&#20195;&#30721;&#12290;
<span class="org-level-1">* &#19987;&#19994;&#25216;&#33021;&#65306;</span>
+ &#20855;&#26377;&#36739;&#24378;&#33258;&#23398;&#33021;&#21147;&#65292;&#29087;&#24713;erlang ,emacs lisp &#20989;&#25968;&#24335;&#32534;&#36753;&#35821;&#35328;&#12290;
+ &#29087;&#24713;mnesia&#12289;ets ,&#29087;&#24713;erlang &#30340;OTP(gen_server gen_event&#31561;&#27169;&#22359;&#30340;&#20351;&#29992;) &#12290;
+ &#19968;&#24180;Emacs&#32534;&#36753;&#22120;&#20351;&#29992;&#32463;&#39564;&#65292;&#29087;&#32451;&#25484;&#25569;Emacs Lisp&#35821;&#35328;&#65292;&#20026;emacs&#24320;&#28304;&#31038;&#21306;&#36129;&#29486;&#36807;&#20195;&#30721;&#65292;
+ &#20854;&#20013;&#20027;&#35201;&#20195;&#30721;&#25918;&#22312; <span class="org-link">emacswiki/Joseph</span> ,&#21253;&#25324;erlang&#24320;&#21457;&#29992;&#30340; <span class="org-link">erlang-dired-mode.el</span>
  &#24182;&#23545; emacs&#19979; erlang &#24320;&#21457;&#24037;&#20855;distel &#36827;&#34892;&#22686;&#24378;<span class="org-link">distel&#20171;&#32461;</span>
+ &#21322;&#24180;erlang&#23454;&#38469;&#24320;&#21457;&#32463;&#39564;&#12289;&#26377;&#19968;&#23450;&#30340;&#20195;&#30721;&#31215;&#32047;
+ &#19977;&#24180;Linux(Gentoo)&#31995;&#32479;&#20351;&#29992;&#32463;&#39564;&#12290;
+ &#25484;&#25569;&#22522;&#20110;Oracle&#30340;&#25968;&#25454;&#24211;&#32534;&#31243;&#65306;JDBC &#12289; PLSQL&#65307;
+ &#29087;&#24713;java &#32534;&#31243;&#35821;&#35328;&#65292;&#26377;&#19968;&#23450;&#30340;c c++&#22522;&#30784;
<span class="org-level-1">* &#24320;&#21457;&#32463;&#39564;&#65306;</span>
<span class="org-level-2">** &#39029;&#28216;&#26691;&#22253;&#22806;&#20256;&#39033;&#30446;(2012-2~2012-9)</span>
   &#22312;&#20048;&#20803;&#32032;&#20844;&#21496;&#26071;&#19979;&#26691;&#22253;&#22806;&#20256;&#39033;&#30446;&#32452;&#20869;&#36127;&#36131;erlang&#26381;&#21153;&#22120;&#31471;&#20195;&#30721;&#30340;&#32534;&#20889;,&#26377;erlang&#36830;
   mysql memcached&#31561;&#25968;&#25454;&#24211;&#30340;&#32463;&#39564;&#65292;&#20102;&#35299; memcached&#12289;redis&#30340;&#21327;&#35758;&#24182;&#23581;&#35797;
   &#29992;erlang&#23454;&#29616;&#19982;&#20043;&#36830;&#25509;,&#26377;&#19968;&#23450;&#30340;&#20195;&#30721;&#31215;&#32047;&#21450;&#35843;&#20248;&#32463;&#39564;.

<span class="org-level-2">**      &#28023;&#21326;&#29983;&#20135;&#31649;&#29702;&#31995;&#32479;(2011-7~2011-11)</span>
    &#20026;&#38738;&#23707;&#28023;&#21326;&#32420;&#32500;&#26377;&#38480;&#20844;&#21496;&#65288;&#20027;&#35201;&#29983;&#20135;&#20551;&#21457;&#30340;&#21322;&#25104;&#21697;&#65289;&#32534;&#20889;&#29983;&#20135;&#31649;&#29702;&#31995;&#32479; &#12290;&#20027;&#35201;&#20998;&#20026;&#19977;&#22823;&#27169;&#22359;&#65306;
1. &#25968;&#25454;&#25910;&#38598;&#27169;&#22359;&#20027;&#35201;&#36890;&#36807;PDA(&#25484;&#19978;&#30005;&#33041;)&#26465;&#30721;&#25195;&#25551;&#22120;&#20174;&#21508;&#34955;&#21322;&#21046;&#21697;&#19978;&#30340;&#26465;&#30721;&#19978;&#25195;&#25551;&#24471;&#21040;&#25968;
      &#25454;(&#36827;&#34892;&#30424;&#28857;)&#12289;&#20197;&#21450;&#36827;&#34892;&#20837;&#24211;&#12289;&#20986;&#24211;&#25805;&#20316;&#12290;
2. PC &#31471;&#65292;&#20063;&#21516;&#26102;&#21487;&#20197;&#36827;&#34892;&#20837;&#24211;&#12289;&#20986;&#24211;&#12289;&#25968;&#25454;&#32479;&#35745;&#12289;&#30424;&#28857;&#12289;&#26465;&#24418;&#30721;&#25171;&#21360;&#31561;&#25805;&#20316;&#12290;PC&#31471; &#20027;&#35201;
      &#20351;&#29992;C#&#12289;Silverlight WCF &#31561;&#25216;&#26415;&#65292;&#21518;&#21488;&#25968;&#25454;&#24211;&#29992;SQL Server 2008&#12290; &#21069;&#21488;&#30028;&#38754;&#20351;
      &#29992;Silverlight&#27169;&#20223;Window7 &#25805;&#20316;&#31995;&#32479;&#65292;&#20027;&#35201;&#23454;&#29616;&#20102;&#29992;&#25143;&#26435;&#38480;&#25511;&#21046;&#12289;&#21322;&#21046;&#21697;&#65288;&#20998;&#20026;4
      &#20010;&#31867;&#20284;&#27169;&#22359;:&#21322;&#21046;&#21697;&#20179;&#24211;&#12289;&#20013;&#38388;&#20179;&#24211;&#12289;&#28748;&#22721;&#20179;&#24211;&#12289;&#31881;&#30862;&#19997;&#20179;&#24211;&#65289;&#20998;&#21035;&#26377;&#20837;&#24211;&#12289;&#20986;&#24211;&#12289;
      &#32479;&#35745;&#12289;&#30424;&#28857;&#31561;&#21151;&#33021;&#12290;
3. &#26465;&#24418;&#30721;&#30340;&#29983;&#25104;&#36890;&#36807;&#35843;&#29992;TSC dll&#30340;&#25171;&#21360;&#21151;&#33021;&#23454;&#29616;&#12290;&#25171;&#21360;&#27169;&#22359;&#21508;&#29420;&#20570;&#25104;&#19968;&#20010;&#26381;&#21153;&#65292;&#25918;&#22312;&#26381;
      &#21153;&#22120;&#19978;&#65292;&#26080;&#35770;&#26159;&#25195;&#25551;&#22120;&#31471; &#12289;&#36824;&#26159;PC&#31471;&#37117;&#21487;&#20197;&#36828;&#31243;&#35843;&#29992;&#25171;&#21360;&#26426;&#36827;&#34892;&#26465;&#24418;&#30721;&#30340;&#25171;&#21360;
4. &#25105;&#20027;&#35201;&#36127;&#36131;&#30340;tsc&#26465;&#30721;&#25171;&#21360;&#26381;&#21153;&#30340;&#32534;&#20889;&#12289;&#21450;&#26465;&#24418;&#30721;&#25195;&#25551;&#22120;&#31471;3&#20010;&#20986;&#24211;&#30011;&#38754;&#12289;&#21322;&#21046;&#21697;&#30424;&#28857;&#12289;
   &#28748;&#22721;&#30424;&#28857;)(&#28748;&#22721;&#20837;&#24211;)&#12289; &#31561;&#22810;&#20010;&#30011;&#38754;&#12290;PC&#31471;&#36127;&#36131;1&#20010;&#30424;&#28857;&#30011;&#38754;(&#21322;&#21046;&#21697;&#30424;&#28857;)&#12289;3&#20010;&#20986;&#24211;&#30011;
   &#38754;(&#20013;&#38388;&#20179;&#24211;&#20986;&#24211;&#12289;&#28748;&#22721;&#20986;&#24211;&#12289; &#31881;&#30862;&#19997;&#20986;&#24211;&#12289;)&#12289;&#21450;&#21322;&#21046;&#21697;&#30340;&#31649;&#29702;(&#26032;&#22686;&#12289;&#26356;&#26032;&#12289;&#20923;&#32467;&#12289;
   &#21021;&#22987;&#21270;&#24211;&#23384;)&#31561;&#25805;&#20316;&#12290;
</pre>
  </body>
</html>
